{
  "intents": [
{
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "help",
        "Is anyone there?",
        "Hello",
        "need help"
      ],
      "responses": [
        "Hi there, what can I do for you?",
        "Hi there, how can I help?"
      ]
    },
    {
      "tag": "apply",
      "patterns": [
        "how to apply for credit card",
        "apply for card",
        "apply for fd",
        "apply for debit card",
        "apply for saving accounts",
        "apply for mutual funds",
	"apply for fixed deposit",
	"apply for scheme",
	"apply for "
      ],
      "responses": [
        "Please the reach following page to apply for it:-
	   applyonline.hdfcbank.com"
      ]
    },
    {
      "tag": "complaint",
      "patterns": 								["how to register a comaplaint",
 	"register a complaint",
	"complaint"],
      "responses": [
        "you can register a complaint at :-
     	https://leads.hdfcbank.com/applications/webforms/apply/complaint_form_new.as	p"
      ]
    },
    {
      "tag": "password",
      "patterns": ["How do I change my password","change password",],
      "responses": ["After you have logged in, you can change your password using the "Change password" option in the top part of the screen. You have to type your current password and the new password you have chosen in their respective boxes."]
    },
    {
      "tag": "pin",
      "patterns": [
        "how to reset a pin",
	"reset pin"
      ],
      "responses": [
        "Reset ATM PIN using the ATM itself
If you are at the ATM and realise “I forgot my ATM Card PIN number” after putting your card inside the machine, do not worry.

Choose Forgot PIN or Regenerate ATM PIN option on the menu. You would be redirected to a screen to enter your registered mobile number, which triggers an OTP to that number. Enter the OTP on the screen, and you would be redirected to choose another PIN. The reset through this mechanism happens immediately, and you can withdraw cash once it resets.

Reset ATM PIN Online using NetBanking
It is not just in the ATMs, you could forget your Debit Card PIN while paying at a store or in restaurants. While it can be embarrassing, there are quick remedies to fix such sticky situations as well. Almost all banks offer quick reset of ATM pins through NetBanking.

So if you have registered for NetBanking facilities, all you need to do is log in through your phone and go the cards section and request Instant PIN Generation. They usually ask you for card details, CVV number, expiry date, and an OTP is generated to your registered mobile number to authenticate the user, and you could enter a PIN of your choice and confirm. You could then directly use the newly generated PIN at the point of sales machine.

Reset ATM PIN Online using MobileApps
Every mobile bank application is also equipped to accommodate these requests and if you have a smartphone with internet connectivity, by merely entering your card details in the app along with your CVV number and an OTP you could reset the card PIN immediately. However, some banks also allow you to directly view the PIN you forgot your Credit Card PIN or your Debit Card PIN, right after logging in with your credentials.

Reset ATM PIN at the Branch
In some situations, when you are travelling, and you realise both the above methods tedious: as ATMs might be far and few and internet connections weak. When you realise “I forgot my PIN number to my Debit Card” in such situations, all you need to do is call up the bank customer care line and request for a PIN reset. The bank dispatches the PIN to your registered mailing address; however, if you are travelling, you could place a request to send the new PIN to the nearest branch from where you can collect it in person.

Also, if there is a branch in the nearby vicinity, you could fill the form directly at the branch and request for a reset which would then again be sent across to your mailing address or you could collect it in the same office.
"
      ]
    },
    {
      "tag": "debit card unblock",
      "patterns": [
        "how to unblock a debit card",
        "steps to unblock a debit card"
      ],
      "responses": [
        "To unblock your HDFC debit card, contact HDFC Bank Card Customer Service at 1800 202 6161/ 1860 267 6161."
      ]
    },
    {
      "tag": "debit card block",
      "patterns": [
        "How to block debit card",
        "steps to block debit card"
      ],
      "responses": [
        "Call the HDFC customer support at 1860 267 6161, 1800 202 6161 or +9122 61606160 (in case you are travelling outside India) to block your HDFC debit card."
      ]
    },
    {
      "tag": "activate debit card",
      "patterns": [
        " how to activate a debit card",
        "steps to activate debit card",
        "activate debit card"
      ],
      "responses": [
        "The procedure is simple:

Once you get your welcome kit from the bank, along with the Debit Card, there is an ATM pin given in a sealed envelope.
When you go to the ATM, enter your Debit Card and enter the ATM pin provided in the welcome kit. On entering this PIN, you will be prompted to change your ATM PIN.
Change your ATM PIN and use the card henceforth for regular transactions.
There is a way to activate a Debit Card online via NetBanking. For that,

You need to login to the respective bank’s internet banking portal. Once you log in, go to the section marked as ‘Debit Card’.
There will be instructions on how to generate an ATM PIN for your Debit Card.
Generate an ATM PIN by following those instructions and your Debit Card will be activated online.
Some banks even have a procedure to activate the Debit Card via Phone Banking.

There is usually a phone banking PIN or some identifier in the bank’s welcome kit. This can be used to identify yourself in phone banking conversations.
Dial the bank’s phone banking number and use the PIN number or security questions to verify yourself.
Once verified, follow the instructions to activate your Debit Card.
Some banks have an additional layer of security, where an OTP is sent to the registered mobile number while setting the ATM PIN in an ATM or via Phone Banking. This helps to ensure the verification and activation is authorised.

HDFC Bank has a seamless procedure to activate a Debit Card. By using NetBanking or Phone Banking, your new Debit Card can be activated in a matter of a few hours.}
"
      ]
    },
{"tag":"contact",
"patterns":["customer care number","how to contact you","contact details"],
"responses":["Contact us at:-https://www.hdfcbank.com/personal/need-help/contact-us"]},
{"tag":"none of the above",
"patterns":[],
"responses":["For further questions check out the page:-
https://www.hdfcbank.com/personal/need-help/faqs",
"For further queries you could contact on our customer care number:-
Customers travelling abroad can reach us on +9122 61606160

Customers of Imperia Account, Diners Black Credit Card and Infinia Credit Card can reach us on our dedicated Customer Care Number +9122 61717606"]
     }
  ]
}
